STMicroelectronics/x-cube-iota1/Middlewares/ST/STM32_Connect_Library/core/net_os.c
/**
  ******************************************************************************
  * @file    net_os.c
  * @author  MCD Application Team
  * @brief   OS needed functions implementation
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */

#include "net_connect.h"
#include "net_internals.h"
#include "stdarg.h"

#ifdef NET_USE_RTOS
#include "task.h"

#if defined(NET_PERF_TASK)
static const char_t    *GetTaskName(TaskHandle_t xHandle);

#define TAG_TASK_ID     7U
#define MERGE_TASKID_AND_TIME(TASK_NUM,TIME_VALUE)       (((TASK_NUM) & 7U) + ((TIME_VALUE)<<3U))
#define EXTRACT_TASK_ID(VALUE)           ((VALUE) & 7U)
#define EXTRACT_DTIME(VALUE)             ((VALUE)>>3U)

#endif /* NET_PERF_TASK */

#if (osCMSIS >= 0x20000U)
#define OSSEMAPHOREWAIT         osSemaphoreAcquire
#else
#define OSSEMAPHOREWAIT         osSemaphoreWait
#endif /* osCMSIS */

extern void *pxCurrentTCB;


static osSemaphoreId   net_mutex[NET_LOCK_NUMBER];

void net_init_locks(void)
{
#if (osCMSIS < 0x20000U)
  static osSemaphoreDef_t mutex_def[NET_LOCK_NUMBER] = {0};
#endif /* osCMSIS */
#ifdef NET_MBEDTLS_HOST_SUPPORT
  net_tls_init();
#endif /* NET_MBEDTLS_HOST_SUPPORT */
  for (int32_t i = 0; i < NET_LOCK_NUMBER; i++)
  {
#if (osCMSIS < 0x20000U)
    net_mutex[i] = osSemaphoreCreate(&mutex_def[i], 1);
#else
    net_mutex[i] = osSemaphoreNew(1, 1, NULL);

#endif /* osCMSIS */
    NET_ASSERT(net_mutex[i] > 0, "Failed on mutex creation");
  }
}

void net_destroy_locks(void)
{
#ifdef NET_MBEDTLS_HOST_SUPPORT
  net_tls_destroy();
#endif /* NET_MBEDTLS_HOST_SUPPORT */
  for (int32_t i = 0; i < NET_LOCK_NUMBER; i++)
  {
    (void)osSemaphoreDelete(net_mutex[i]);
  }
}

void net_lock(int32_t sock, uint32_t timeout_in)
{
  int32_t   ret;
  uint32_t timeout = timeout_in;
  if (timeout ==  NET_OS_WAIT_FOREVER)
  {
    /*MISRA issue so hand coded  osWaitForever*/
    timeout = 0xffffffffU;
  }
  ret = (int32_t) OSSEMAPHOREWAIT(net_mutex[sock], timeout);
  NET_ASSERT(ret == 0, "Failed locking mutex");
}

void net_unlock(int32_t sock)
{
  int32_t   ret;
  ret = (int32_t) osSemaphoreRelease(net_mutex[sock]);
  NET_ASSERT(ret == 0, "Failed unlocking mutex");
}

void net_lock_nochk(int32_t sock, uint32_t timeout_in)
{
  uint32_t timeout = timeout_in;
  if (timeout == NET_OS_WAIT_FOREVER)
  {
    /* MISRA issue so hand coded  t osWaitForever*/
    timeout = 0xffffffffU;
  }
  (void) OSSEMAPHOREWAIT(net_mutex[sock], timeout);
}

void net_unlock_nochk(int32_t sock)
{
  (void) osSemaphoreRelease(net_mutex[sock]);
}




#if !defined(NET_ALLOC_DEBUG)

/*cstat -MISRAC2012-Rule-21.2 */
void    *net_calloc(size_t n, size_t m)
{
  void *p;
  /*cstat -MISRAC2012-Rule-21.3 -MISRAC2012-Dir-4.12 */
  p =   pvPortMalloc(n * m);
  /*cstat +MISRAC2012-Rule-21.3 +MISRAC2012-Dir-4.12 */
  if (p != NULL)
  {
    (void) memset(p, 0, n * m);
  }
  return p;
}

void *net_realloc(void *ptr, size_t size)
{
  void *ret;
  if (ptr == NULL)
  {
    if (size != (size_t) 0)
    {
      /*cstat -MISRAC2012-Rule-21.3 -MISRAC2012-Dir-4.12 */
      ret = pvPortMalloc(size);
      /*cstat +MISRAC2012-Rule-21.3 +MISRAC2012-Dir-4.12 */
      if (ret == NULL)
      {
        /* to avoid erroneous MISRA detection */
        ret = NULL;
      }
    }
    else
    {
      ret = NULL;
    }
  }
  else
  {
    if (size != (size_t) 0)
    {
      void *new_ptr;
      /*cstat -MISRAC2012-Rule-21.3 -MISRAC2012-Dir-4.12 */
      new_ptr = pvPortMalloc(size);
      /*cstat +MISRAC2012-Rule-21.3 +MISRAC2012-Dir-4.12 */
      if (new_ptr != NULL)
      {
        (void) memcpy(new_ptr, ptr, size);
        /*cstat -MISRAC2012-Rule-21.3 -MISRAC2012-Dir-4.12 */
        vPortFree(ptr);
        /*cstat +MISRAC2012-Rule-21.3 +MISRAC2012-Dir-4.12 */
        ret = new_ptr;
      }
      else
      {
        ret = NULL;
      }
    }
    else
    {
      /*cstat -MISRAC2012-Rule-21.3 -MISRAC2012-Dir-4.12 */
      vPortFree(ptr);
      /*cstat +MISRAC2012-Rule-21.3 +MISRAC2012-Dir-4.12 */
      ret = NULL;
    }
  }
  return ret;
}
#endif /* !NET_ALLOC_DEBUG */

/* below function are not supposed to be used , all malloc /free should be mapped to NET_MALLOC/NET_FREE macros  */
/* if not the case , it means that some mapping are missing                                                      */
/* Using directly the malloc/free prevent to track original location of memory leakages                           */

/*cstat -MISRAC2012-Rule-21.2 */

void *realloc(void *p, size_t n)
{
  return NET_REALLOC(p, n);
}

void    *calloc(size_t n, size_t m)
{
  return NET_CALLOC(n, m);
}


void *malloc(size_t n)
{
  return NET_MALLOC(n);
}

void free(void *p)
{
  NET_FREE(p);
}
/*cstat +MISRAC2012-Rule-21.2 */


#endif /* NET_USE_RTOS */





#ifdef NET_ALLOC_DEBUG



#ifdef NET_ALLOC_DEBUG_TREE

#define NET_DISPLAY_RESULT_COLUMN                       (NET_DISPLAY_WIDTH-((2U*NET_DISPLAY_RESULT_WIDTH)+1U))

typedef struct net_alloc_node_s
{
  const char_t                          *name;
  uint32_t                              namelen;
  struct        net_alloc_node_s        *down;
  struct        net_alloc_node_s        *up;
  struct        net_alloc_node_s        *neighbour;
  uint32_t                              current_alloc;
  uint32_t                              max_total_alloc;
#ifdef NET_ALLOC_HISTOGRAM
  uint16_t                              histogram[NET_MALLOC_MAX_HISTOGRAM];
#endif /* NET_ALLOC_HISTOGRAM */
} net_alloc_node_t;


static  net_alloc_node_t        node[NET_ALLOC_MAX_NODE + 1U];
static  net_alloc_node_t        *root_node;
static  uint32_t                max_node;

#endif /* NET_ALLOC_DEBUG_TREE */

typedef struct net_debug_alloc
{
  const char_t *filename;
  uint16_t line;
  uint16_t iter;
  uint32_t size;
  void      *p;
#ifdef NET_ALLOC_DEBUG_TREE
  net_alloc_node_t      *node;
#endif /* NET_ALLOC_DEBUG_TREE */
} net_debug_alloc_t;

static uint32_t  current_alloc   = 0;
static uint32_t  max_total_alloc = 0;

static uint32_t  iteralloc       = 0;
static uint32_t  iterfree        = 0;
static uint32_t  max_alive_alloc = 0;
static net_debug_alloc_t        allocated_info[NET_LEAKAGE_ARRAY];


void *net_calloc_debug(size_t nn, size_t msize, const char_t *filename, uint32_t line)
{
  /*cstat -MISRAC2012-Dir-4.12 */
  void *p = net_malloc_debug(nn * msize, filename, line);
  /*cstat +MISRAC2012-Dir-4.12 */

  if (p != NULL)
  {
    (void) memset(p, 0, nn * msize);
  }
  return p;
}

void *net_realloc_debug(void *p, size_t size, const char_t *filename, uint32_t line)
{
  void *ret;
  if (p == NULL)
  {
    if (size != (size_t) 0)
    {
      /*cstat -MISRAC2012-Rule-21.3 -MISRAC2012-Dir-4.12 */
      ret = net_malloc_debug(size, filename, line);
      /*cstat +MISRAC2012-Rule-21.3 +MISRAC2012-Dir-4.12 */
      if (ret == NULL)
      {
        /* to avoid erroneous MISRA detection */
        ret = NULL;
      }
    }
    else
    {
      ret = NULL;
    }
  }
  else
  {
    if (size != (size_t) 0)
    {
      void *new_ptr;
      /*cstat -MISRAC2012-Rule-21.3 -MISRAC2012-Dir-4.12 */
      new_ptr =  net_malloc_debug(size, filename, line);
      /*cstat +MISRAC2012-Rule-21.3 +MISRAC2012-Dir-4.12 */
      if (new_ptr != NULL)
      {
        (void) memcpy(new_ptr, p, size);
        /*cstat -MISRAC2012-Rule-21.3 -MISRAC2012-Dir-4.12 */
        net_free_debug(p);
        /*cstat +MISRAC2012-Rule-21.3 +MISRAC2012-Dir-4.12 */
        ret = new_ptr;
      }
      else
      {
        ret = NULL;
      }
    }
    else
    {
      /*cstat -MISRAC2012-Rule-21.3 -MISRAC2012-Dir-4.12 */
      net_free_debug(p);
      /*cstat +MISRAC2012-Rule-21.3 +MISRAC2012-Dir-4.12 */
      ret = NULL;
    }
  }
  return ret;
}

