STMicroelectronics/x-cube-iota1/Middlewares/ST/STM32_Connect_Library/core/net_os.c
#ifdef NET_ALLOC_DEBUG_TREE

static uint32_t        getdirlen(const char_t *filename_in)
{
  uint32_t   len = 0;
  const char_t  *filename = filename_in;

  if (*filename != '\0')
  {

    if (*filename == '\\')
    {
      len = 1;
      filename++;
    }

    if ((filename[0] == 'C') && (filename[1] == ':') && (filename[2] == '\\'))
    {
      len = 3;
      filename++;
      filename++;
      filename++;
    }

    while ((*filename != '\0') && (*filename != '\\'))
    {
      len++;
      filename++;
    }
  }
  return len;
}


static net_alloc_node_t *get_new_node(const char_t *filename, uint32_t dir_name_len, uint32_t  n)
{
  net_alloc_node_t      *p = &node[max_node];
  uint32_t               next_dir_name_len = getdirlen(&filename[dir_name_len]);

  max_node++;
  p->current_alloc = n;
  p->max_total_alloc = n;
  p->name         = filename;
  p->namelen = dir_name_len;
  if (max_node == NET_ALLOC_MAX_NODE)
  {
    while (true)
    {
      (void) printf("ERROR: Please increase NET_ALLOC_MAX_NODE, current value %lu is too low\n", NET_ALLOC_MAX_NODE);
    }
  }

  if (next_dir_name_len != 0U)
  {
    /*cstat -MISRAC2012-Rule-17.2_a */
    p->down = get_new_node(&filename[dir_name_len], next_dir_name_len, n);
    /*cstat +MISRAC2012-Rule-17.2_a */
    p->down->up = p;
  }
  return p;
}


#ifdef NET_ALLOC_HISTOGRAM
static void histogram(net_alloc_node_t *root, uint32_t  n_in)
{
  uint32_t       nn = n_in;
  int32_t       ln2 = 0;
  while (nn != 0U)
  {
    nn >>= 1;
    ln2++;
  }
  ln2 -= 5;
  if (ln2 < 0)
  {
    ln2 = 0;
  }
  if (ln2 > (NET_MALLOC_MAX_HISTOGRAM - 1))
  {
    ln2 = NET_MALLOC_MAX_HISTOGRAM - 1;
  }
  root->histogram[ln2]++;
}
#endif /* NET_MALLOC_MAX_HISTOGRAM */


static net_alloc_node_t  *net_walk_malloc_node(net_alloc_node_t *root, const char_t     *filename, uint32_t     n)
{
  net_alloc_node_t      *p = root;
  uint32_t              dir_name_len = getdirlen(filename);

  /* search among the neighbour (same level tree) */
  while (NULL != p)
  {
    if (strncmp(p->name, filename, dir_name_len) == 0)
    {
      /* find a matching neighbour */
      p->current_alloc += n;
      if (p->current_alloc > p->max_total_alloc)
      {
        p->max_total_alloc = p->current_alloc;
      }
      /*printf("ALLOC %s %d %d inc %d\n",filename,p->max_total_alloc,p->current_alloc,n);*/
      /* Did not reach a leaf so continue down in the tree */
      if (filename[dir_name_len] != '\0')
      {
        /*cstat -MISRAC2012-Rule-17.2_a */
        p = net_walk_malloc_node(p->down, &filename[dir_name_len], n);
        /*cstat +MISRAC2012-Rule-17.2_a */
      }
#ifdef NET_ALLOC_HISTOGRAM
      else
      {
        histogram(p, n);
      }
#endif /* NET_ALLOC_HISTOGRAM */
      break;
    }
    p = p->neighbour;
  }

  if (NULL == p)
  {
    /* create a new neighbour and all the associated tree */
    p = get_new_node(filename, dir_name_len, n);
    /* add to neighbour list */
    if (NULL != root)
    {
      p->up = root->up;
      p->neighbour = root->neighbour;
      root->neighbour = p;
    }
    /* but we should return the leaf */
    while (NULL != p->down)
    {
      p = p->down;
    }
#ifdef NET_ALLOC_HISTOGRAM
    histogram(p, n);
#endif /* NET_ALLOC_HISTOGRAM */

  }
  return p;
}

static void net_walk_free_node(net_alloc_node_t *node_in, uint32_t     n)
{
  net_alloc_node_t *node = node_in;
  while (NULL != node)
  {
    node->current_alloc  -= n;
    /*printf("FREE %s %d %d inc %d\n",node->name,node->max_total_alloc,node->current_alloc,n);*/
    node = node->up;
  }
}

static net_alloc_node_t    *net_malloc_tree_start(net_alloc_node_t *root)
{
  net_alloc_node_t      *p = root;

  while (NULL == p->down->neighbour)
  {
    p = p->down;
  }
  return p;
}

static void    net_malloc_tree_print(net_alloc_node_t *root, uint32_t level)
{
  net_alloc_node_t      *p = root;
  if (level == 0U)
  {
    (void) printf("\n### Dynamic Allocation tree report, uses %lu nodes out of %lu (%lu bytes)\n", max_node,
                  NET_ALLOC_MAX_NODE, max_node * sizeof(net_alloc_node_t));
    for (uint32_t i = 0U; i < NET_DISPLAY_RESULT_COLUMN; i++)
    {
      (void) printf("-");
    }
    (void) printf("%*s %*s", NET_DISPLAY_RESULT_WIDTH, "Maximum", NET_DISPLAY_RESULT_WIDTH, "Leakage");
    (void) printf("\n");
  }

  while (NULL != p)
  {
    {
      char_t sn[100];
      uint32_t       ww = level;
      uint32_t       nn = NET_DISPLAY_RESULT_COLUMN - ((level + 1U) * NET_DISPLAY_TAB) - NET_DISPLAY_DIRNAME_LEN;
      (void) strncpy(sn, &p->name[1], p->namelen - 1U);
      sn[p->namelen - 1U] = '\0';
      (void) printf("%*c", NET_DISPLAY_TAB, ' ');
      while (ww != 0U)
      {
        ww--;
        (void) printf(".");
#if  (NET_DISPLAY_TAB>1)
        (void)printf("%*c", NET_DISPLAY_TAB - 1U, ' ');
#endif /* NET_DISPLAY_TAB */
      }
      (void) printf("%-*s", NET_DISPLAY_DIRNAME_LEN, sn);
      if ((NULL != p->down) && (p->down->max_total_alloc == p->max_total_alloc)
          && (p->down->current_alloc == p->current_alloc))
      {
        (void) printf("\n");
      }
      else
      {
        (void) printf("%*c%*d %*d\n", nn, ' ', NET_DISPLAY_RESULT_WIDTH, p->max_total_alloc, NET_DISPLAY_RESULT_WIDTH,
                      p->current_alloc);
#ifdef NET_ALLOC_HISTOGRAM
        for (int32_t i = 0; i < NET_MALLOC_MAX_HISTOGRAM; i++)
        {
          if (p->histogram[i] != 0U)
          {
            (void) printf("%*c    histogram [ %d..%d ] = %lu\n", nn, ' ', \
                          (i > 0) ? 1U << ((uint32_t)i + 4U) : 0, 1U << ((uint32_t)i + 5U), p->histogram[i]);
          }
        }
#endif /* NET_ALLOC_HISTOGRAM */
      }
    }
    /*cstat -MISRAC2012-Rule-17.2_a */
    net_malloc_tree_print(p->down, level + 1U);
    /*cstat +MISRAC2012-Rule-17.2_a */
    p = p->neighbour;
  }
}

#endif /* NET_ALLOC_DEBUG_TREE */


void *net_malloc_debug(size_t nn, const char_t *filename, uint32_t line)
{

  void          *pp;
  uint32_t      i;

#ifdef NET_USE_RTOS
  vTaskSuspendAll();
#endif /* NET_USE_RTOS */


  if (iteralloc == 0U)
  {
    (void) memset(allocated_info, 0, sizeof(allocated_info));
    current_alloc = 0;
    max_total_alloc = 0;
#ifdef NET_ALLOC_DEBUG_TREE
    max_node = 0;
    root_node = NULL;
    (void) memset(node, 0, sizeof(node));
#endif /* NET_ALLOC_DEBUG_TREE */
  }


