STMicroelectronics/x-cube-iota1/Middlewares/ST/STM32_Connect_Library/core/net_os.c
  iteralloc++;
  current_alloc += nn;
  if (current_alloc > max_total_alloc)
  {
    max_total_alloc = current_alloc;
  }
  /*printf("-ALLOC- Max %d Current %d inc %d\n",max_total_alloc,current_alloc,nn);*/

#ifdef NET_USE_RTOS
  pp = pvPortMalloc(nn + NET_ALLOC_OVERWRITE_CHECK_OFFSET);
#else
  /*cstat -MISRAC2012-Dir-4.12 -MISRAC2012-Dir-4.7_b -MISRAC2012-Rule-21.3 */
  pp = malloc(nn + NET_ALLOC_OVERWRITE_CHECK_OFFSET);
  /*cstat +MISRAC2012-Dir-4.12 +MISRAC2012-Dir-4.7_b +MISRAC2012-Rule-21.3 */
#endif /* NET_USE_RTOS */
  if (pp == NULL)
  {
    printf("Allocation failure\n");
    while (1);
  }
#if NET_ALLOC_OVERWRITE_CHECK_OFFSET == 4
  *((uint8_t *)((uint8_t *) pp + nn + 0)) = 0xDE;
  *((uint8_t *)((uint8_t *) pp + nn + 1)) = 0xAD;
  *((uint8_t *)((uint8_t *) pp + nn + 2)) = 0xBE;
  *((uint8_t *)((uint8_t *) pp + nn + 3)) = 0xEF;
#endif  /* NET_ALLOC_OVERWRITE_CHECK_OFFSET */
  if ((iteralloc - iterfree) > max_alive_alloc)
  {
    max_alive_alloc = iteralloc - iterfree;
  }

  for (i = 0; i < NET_LEAKAGE_ARRAY ; i++)
  {
    if (allocated_info[i].p == 0U)
    {
      allocated_info[i].p = pp ;
      allocated_info[i].size = nn ;
      allocated_info[i].line = (uint16_t) line ;
      allocated_info[i].filename = filename;
      allocated_info[i].iter = (uint16_t) iteralloc;
#ifdef NET_ALLOC_DEBUG_TREE
      allocated_info[i].node = net_walk_malloc_node(root_node, filename, nn);
      if (NULL == root_node)
      {
        root_node = allocated_info[i].node;
        /* we got the leaf , so move to top */
        while (NULL != root_node->up)
        {
          root_node = root_node->up;
        }
      }
#endif /*  NET_ALLOC_DEBUG_TREE */
      break;
    }
  }

  NET_ASSERT((iteralloc != NET_ALLOC_BREAK), "Reach Allocation break\n");

  NET_ASSERT((i != NET_LEAKAGE_ARRAY), "Too much allocations,Please increase NET_LEAKAGE_ARRAY (%lu)in net_conf.h",
             NET_LEAKAGE_ARRAY);
#if  NET_ALLOC_VERBOSE
  (void) printf("%lu bytes allocated: Allocating size %lu at %s:%lu\n", total_alloc, allocated_info[i].size,
                allocated_info[i].filename, allocated_info[i].line);
#endif /* NET_ALLOC_VERBOSE */

#ifdef NET_USE_RTOS
  (void) xTaskResumeAll();
#endif /* NET_USE_RTOS */

  return pp;
}

void net_free_debug(void *p)
{
  uint32_t i;
#ifdef NET_USE_RTOS
  vTaskSuspendAll();
#endif /* NET_USE_RTOS */

#ifdef NET_FREE_STOP_ON_NULL_POINTER
  if (NULL == p)
  {
    (void) printf("Free function : Freeing a NULL pointer, seriously ?\n");
    while (1);
  }
#endif /* NET_STOP_ON_FREEING_NULL_POINTER */

  if (NULL != p)
  {
    iterfree++;
    for (i = 0; i < NET_LEAKAGE_ARRAY; i++)
    {
      if (allocated_info[i].p == p)
      {
        allocated_info[i].p = NULL;
        current_alloc -= allocated_info[i].size;
#if  NET_ALLOC_OVERWRITE_CHECK_OFFSET == 4
        uint8_t  *dead = (uint8_t *) p + allocated_info[i].size;
        bool dead_failed = false;

        if (dead[0] != 0xDE)
        {
          dead_failed = true;
        }
        if (dead[1] != 0xAD)
        {
          dead_failed = true;
        }
        if (dead[2] != 0xBE)
        {
          dead_failed = true;
        }
        if (dead[3] != 0xEF)
        {
          dead_failed = true;
        }
        if (dead_failed)
        {
          (void) printf("\tAllocation number #%lu  is overwritten ! %p  size %lu at %s:%lu\n",
                        allocated_info[i].iter, allocated_info[i].p,
                        allocated_info[i].size, allocated_info[i].filename, allocated_info[i].line);

          while (1);
        }
#endif /* NET_ALLOC_OVERWRITE_CHECK_OFFSET */


        /*printf("-FREE- Max %d Current %d inc %d\n",max_total_alloc,current_alloc,allocated_info[i].size);*/
#ifdef NET_ALLOC_DEBUG_TREE
        net_walk_free_node(allocated_info[i].node, allocated_info[i].size);
#endif /* NET_ALLOC_DEBUG_TREE */
        allocated_info[i].size = 0;
        break;
      }
    }

    if (i == NET_LEAKAGE_ARRAY)
    {
      /*cstat -MISRAC2012-Rule-1.3_o -MISRAC2012-Rule-1.3_p -MISRAC2012-Dir-4.7_b  */
      /*cstat -MISRAC2012-Dir-4.13_e -MISRAC2012-Dir-4.13_d              */
      (void) printf("Free function : did not find this segment %p\n", p);
      /*cstat +MISRAC2012-Rule-1.3_o +MISRAC2012-Rule-1.3_p +MISRAC2012-Dir-4.7_b   */
      /*cstat +MISRAC2012-Dir-4.13_e +MISRAC2012-Dir-4.13_d             */
      while (true) {};
    }
  }

#ifdef NET_USE_RTOS
  vPortFree(p);
  (void) xTaskResumeAll();
#else
  /*cstat -MISRAC2012-Rule-21.3 */
  free(p);
  /*cstat +MISRAC2012-Rule-21.3 */
#endif /* NET_USE_RTOS */

}

void net_alloc_report(void)
{
  uint32_t      i;
  uint32_t      count = 0;
  uint32_t      leak = 0;

#ifdef NET_USE_RTOS
  vTaskSuspendAll();
#endif /* NET_USE_RTOS */

  (void) printf("\n### Net Malloc report: max alloc: %lu bytes, current leakage: %lu bytes,\
  number of allocation: %lu, number of free: %lu, alloc table usage %lu/%lu (%lu) bytes\n\n",
                max_total_alloc, current_alloc, iteralloc, iterfree, max_alive_alloc,
                NET_LEAKAGE_ARRAY, sizeof(allocated_info));

  for (i = 0; i < NET_LEAKAGE_ARRAY; i++)
  {
    if (allocated_info[i].p != 0)
    {
      count++;
      leak += allocated_info[i].size;
      (void) printf("\tAllocation number #%lu Not free %p  size %lu at %s:%lu\n",
                    allocated_info[i].iter, allocated_info[i].p,
                    allocated_info[i].size, allocated_info[i].filename, allocated_info[i].line);
    }
  }
  (void) printf("\n%lu allocation not freed  %lu bytes out of %lu allocated byte\n\n", count, leak, max_total_alloc);

#ifdef NET_ALLOC_DEBUG_TREE
  net_malloc_tree_print(net_malloc_tree_start(root_node), 0);
#endif /* NET_ALLOC_DEBUG_TREE */
  (void) printf("\n### Net Malloc end report\n");

#ifdef NET_USE_RTOS
  (void) xTaskResumeAll();
#endif /* NET_USE_RTOS */

}

#endif  /* NET_DEBUG_ALLOC */




static  struct net_perf
{
  uint32_t      total;
#if defined(NET_USE_RTOS) && defined(NET_PERF_TASK)
  uint32_t      elapsed_cycle[NET_PERF_MAXTHREAD];
  TaskHandle_t  handle[NET_PERF_MAXTHREAD];
  uint32_t        task_history[NET_TASK_HISTORY_SIZE + 1U];
  uint32_t        prio[NET_TASK_HISTORY_SIZE + 1U];
  uint32_t        task_history_count;
  uint32_t        task_current_cycle;
#endif /* NET_USE_RTOS */

