STMicroelectronics/x-cube-iota1/Middlewares/ST/STM32_Connect_Library/core/net_os.c
}
perf;


#if defined(NET_PERF_TASK)

/**
  * @brief  Executed for each context switch in
  * @param  None
  * @retval None
  */

#if !defined(NET_USE_RTOS)
#error "NET_USE_RTOS must be defined to use NET_PERF_TASK"
#endif /* NET_USE_RTOS */


void net_perf_task_tag(uint32_t msg_id)
{
  if (NET_TASK_HISTORY_SIZE != perf.task_history_count)
  {
    perf.task_history[perf.task_history_count] = MERGE_TASKID_AND_TIME(TAG_TASK_ID, msg_id);
    perf.task_history_count++;
  }
}


static uint32_t GetPrio(TaskHandle_t     xHandle)
{
  uint32_t      vv;
  TaskStatus_t xTaskDetails;

  vTaskGetInfo( /* The handle of the task being queried. */
    xHandle,
    /* The TaskStatus_t structure to complete with information
    on xTask. */
    &xTaskDetails,
    /* Include the stack high water mark value in the
    TaskStatus_t structure. */
    pdTRUE,
    /* Include the task state in the TaskStatus_t structure. */
    eInvalid);

  vv = xTaskDetails.uxBasePriority;
  vv += (xTaskDetails.uxCurrentPriority << 16U);
  return vv;
}


void net_perf_task_in(void)
{

  uint32_t  i;
  TaskHandle_t     xHandle = xTaskGetCurrentTaskHandle();
  for (i = 0; i < NET_PERF_MAXTHREAD; i++)
  {
    if (NULL == perf.handle[i])
    {
      /* new thread */
      perf.handle[i] = xHandle;
    }
    if (xHandle == perf.handle[i])
    {
      perf.elapsed_cycle[i] -= net_get_cycle();
      break;
    }
  }
  NET_ASSERT(NET_PERF_MAXTHREAD != i, "Net perf ,please increase NET_PERF_MAX_THREAD");
}

/**
  * @brief  Executed for each context switch out
  * @param  None
  * @retval None
  */
void net_perf_task_out(void)
{
  uint32_t  i;
  TaskHandle_t     xHandle = xTaskGetCurrentTaskHandle();
  for (i = 0; i < NET_PERF_MAXTHREAD; i++)
  {
    if (NULL == perf.handle[i])
    {
      /* new thread */
      perf.handle[i] = xHandle;
    }
    if (xHandle == perf.handle[i])
    {
      perf.elapsed_cycle[i] += net_get_cycle();
      break;
    }
  }

  if (NET_TASK_HISTORY_SIZE != perf.task_history_count)
  {
    perf.task_history[perf.task_history_count] = MERGE_TASKID_AND_TIME(i, net_get_cycle() - perf.task_current_cycle);
    perf.prio[perf.task_history_count] = GetPrio(xHandle);
    perf.task_history_count++;
    perf.task_current_cycle = net_get_cycle();
  }

  NET_ASSERT(NET_PERF_MAXTHREAD != i, "Net perf ,please increase NET_PERF_MAX_THREAD");
}

static const char_t    *GetTaskName(TaskHandle_t xHandle)
{
  TaskStatus_t xTaskDetails;
  vTaskGetInfo( /* The handle of the task being queried. */
    xHandle,
    /* The TaskStatus_t structure to complete with information
    on xTask. */
    &xTaskDetails,
    /* Include the stack high water mark value in the
    TaskStatus_t structure. */
    pdTRUE,
    /* Include the task state in the TaskStatus_t structure. */
    eInvalid);
  return (const char_t *)xTaskDetails.pcTaskName;
}
#else
void net_perf_task_in(void);
void net_perf_task_out(void);

void net_perf_task_in(void)
{
}
void net_perf_task_out(void)
{
}
#endif /* NET_PERF_TASK */


void    net_perf_start(void)
{
  /*cstat -MISRAC2012-Rule-11.4 */
  NET_DWT_CONTROL |= NET_DWT_CYCCNTENA_BIT ;
  NET_DWT_CYCCNT = 0U;
  /*cstat +MISRAC2012-Rule-11.4 */
  (void) memset(&perf, 0, sizeof(perf));
#if defined(NET_PERF_TASK)


#if NET_TASK_HISTORY_SIZE > 0
  perf.task_current_cycle = net_get_cycle();
#endif /* NET_TASK_HISTORY_SIZE */

  net_perf_task_in();
#endif /* NET_PERF_TASK */
}

void    net_perf_report(void)
{
  extern uint32_t SystemCoreClock;

#if defined(NET_PERF_TASK)
  net_perf_task_out();
#endif /* NET_PERF_TASK */
  perf.total += net_get_cycle();
  (void) printf("\n### Net Performance report    CPU Freq %3lu Mhz\n\n", SystemCoreClock / 1000000U);
  (void) printf("\tTotal   %12lu cycles  %8lu ms\n", perf.total, perf.total / (SystemCoreClock / 1000U));
#if defined(NET_PERF_TASK)
  uint32_t    count = 0;
  (void) printf("\n");
  while (perf.handle[count] != 0)
  {
    (void) printf("\tthread #%lu  %25s : %12lu cycles  %7lu ms\n", count, GetTaskName(perf.handle[count]),
                  perf.elapsed_cycle[count], perf.elapsed_cycle[count] / (SystemCoreClock / 1000U));
    count++;
  }
#endif /* NET_PERF_TASK */


#define TO_MICRO_SECOND    1000000.0
#if NET_TASK_HISTORY_SIZE > 0
  float rf = TO_MICRO_SECOND / SystemCoreClock;
  uint32_t      tt = 0;
  printf("last record index %d out of %d\n", perf.task_history_count, NET_TASK_HISTORY_SIZE);
  for (uint32_t  i = 0; i < perf.task_history_count - 1; i++)
  {
    uint32_t  task_id = EXTRACT_TASK_ID(perf.task_history[i]);
    uint32_t  dtime   = EXTRACT_DTIME(perf.task_history[i]);
    uint32_t  based_prio              = perf.prio[i] & 0xFFFFU;
    uint32_t  inherited_prio   =  perf.prio[i] >> 16U;

    if (TAG_TASK_ID != task_id)
    {
      printf("%08lu    %20s:  %lu us base prio %lu inherited %lu\n",
             (uint32_t)(tt * rf), GetTaskName(perf.handle[task_id]),
             (uint32_t)(dtime * rf), based_prio, inherited_prio);
      tt += dtime;
    }
    else
    {
      printf("            Event %d\n", dtime);
    }
  }
#endif /* NET_TASK_HISTORY_SIZE */


  (void) printf("\n### Net Performance end report\n\n");
}

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

